Revit 2027 API
Document.AutoJoinElements Method
Forces the elements in the Revit document to automatically join to their neighbors where appropriate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AutoJoinElements()
Public Sub AutoJoinElements
public:
void AutoJoinElements()
member AutoJoinElements : unit -> unit
Exceptions
Exception | Condition
AutoJoinFailedException |  Thrown when the operation fails.
Remarks
Use this method to force elements in the document to automatically join to their neighbors. Note that when a transaction is committed there is an automatic call to automatically join elements.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace